In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day27-one-hot-encoding/cars.csv")
df.sample(5)

           brand  km_driven    fuel         owner  selling_price
6477  Volkswagen      50000  Diesel   First Owner         560000
2981      Toyota     120000  Diesel   First Owner         451999
5293     Hyundai      40000  Petrol   First Owner         300000
6440    Mahindra      82500  Diesel  Second Owner         600000
4381     Hyundai     160000  Diesel   Third Owner         395000

In [3]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [4]:
df['brand'].nunique() #32 different brands

32

In [5]:
df['fuel'].value_counts()

Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: fuel, dtype: int64

In [6]:
df['owner'].value_counts()

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

#### 1. OneHotEncoding USING PANDAS

In [7]:
pd.get_dummies(df,columns=['fuel','owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

#### k-1 OneHotEncoding

In [8]:
#Removing first column because of multicollinearity

In [9]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

In [10]:
#using pandas it is not used in ML Projects because pandas does not remember which column is set in which position
#so we use sklearn OneHotEncoder for overcoming this problem

#### OneHotEncoding using SKlearn

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [13]:
x_train,x_test,y_train,y_test = train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=2)

In [14]:
x_train.head()

         brand  km_driven    fuel         owner
5571   Hyundai      35000  Diesel   First Owner
2038      Jeep      60000  Diesel   First Owner
2957   Hyundai      25000  Petrol   First Owner
7618  Mahindra     130000  Diesel  Second Owner
6684   Hyundai     155000  Diesel   First Owner

In [15]:
from sklearn.preprocessing import OneHotEncoder

In [16]:
ohe = OneHotEncoder()

In [ ]:
#onehotEncoder by default produces a sparse matrix we need to convert it to an array

In [17]:
x_train_new = ohe.fit_transform(x_train[['fuel','owner']]).toarray()

In [18]:
x_test_new = ohe.fit_transform(x_test[['fuel','owner']]).toarray()

In [19]:
x_train_new

array([[0., 1., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 1., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.]])

In [20]:
x_test_new

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.]])

In [ ]:
#combining brand,km_driven from x_train and the x_train_new 9 values

In [21]:
x_train[['brand','km_driven']].values #if .values is used we get an array instead of an dataframe

array([['Hyundai', 35000],
       ['Jeep', 60000],
       ['Hyundai', 25000],
       ...,
       ['Tata', 15000],
       ['Maruti', 32500],
       ['Isuzu', 121000]], dtype=object)

In [22]:
#to combine 2 numpy arrays horizontally we use hstack

In [26]:
a = x_train[['brand','km_driven']].values
b = x_train_new
c = np.hstack((a,b))

In [27]:
print(c)

[['Hyundai' 35000 0.0 ... 0.0 0.0 0.0]
 ['Jeep' 60000 0.0 ... 0.0 0.0 0.0]
 ['Hyundai' 25000 0.0 ... 0.0 0.0 0.0]
 ...
 ['Tata' 15000 0.0 ... 0.0 0.0 0.0]
 ['Maruti' 32500 0.0 ... 1.0 0.0 0.0]
 ['Isuzu' 121000 0.0 ... 0.0 0.0 0.0]]

In [28]:
c.shape

(6502, 11)

OneHotEncoder() parameters:

drop = 'first' --> drops the 1st columns of selected columns to eliminate multicollinearity

sparse = False --> By default OneHotEncoder produces sparse matrix to be converted to an numpy array ,if sparse=False is done no conversion required

dtype = np.int32

In [42]:
ohe1 = OneHotEncoder(drop='first',sparse=False,dtype=np.int32)

In [43]:
x_train_new1 = ohe1.fit_transform(x_train[['fuel','owner']])
x_train_new1 = ohe1.fit_transform(x_train[['fuel','owner']])

In [44]:
np.hstack((x_train[['brand','km_driven']].values,x_train_new1))

array([['Hyundai', 35000, 1, ..., 0, 0, 0],
       ['Jeep', 60000, 1, ..., 0, 0, 0],
       ['Hyundai', 25000, 0, ..., 0, 0, 0],
       ...,
       ['Tata', 15000, 0, ..., 0, 0, 0],
       ['Maruti', 32500, 1, ..., 1, 0, 0],
       ['Isuzu', 121000, 1, ..., 0, 0, 0]], dtype=object)

In [45]:
np.hstack((x_train[['brand','km_driven']].values,x_train_new1)).shape

(6502, 9)

####  OneHotEncoding with Top Categories

In [51]:
count = df['brand'].value_counts()
count

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [48]:
df['brand'].nunique()

32

In [52]:
count = count[count<=100]
count

Nissan           81
Jaguar           71
Volvo            67
Datsun           65
Mercedes-Benz    54
Fiat             47
Audi             40
Lexus            34
Jeep             31
Mitsubishi       14
Force             6
Land              6
Isuzu             5
Kia               4
Ambassador        4
Daewoo            3
MG                3
Ashok             1
Opel              1
Peugeot           1
Name: brand, dtype: int64

In [55]:
temp = count.index
temp

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Force', 'Land', 'Isuzu', 'Kia',
       'Ambassador', 'Daewoo', 'MG', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object')

In [58]:
pd.get_dummies(df['brand'].replace(temp,'Uncommon')).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Uncommon,Volkswagen
795,0,1,0,0,0,0,0,0,0,0,0,0,0
7697,0,0,0,0,0,0,1,0,0,0,0,0,0
2444,0,0,0,0,0,1,0,0,0,0,0,0,0
5807,0,0,1,0,0,0,0,0,0,0,0,0,0
3855,0,0,0,0,0,0,0,0,0,0,1,0,0